[
    {
        "title": "Project 1",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "year": 2025,
        "description": "Worked extensively on a gripping data visualization regarding average monthly climate measurements for six major U.S. cities including San Francisco, San Diego, Miami, Houston, New York City, and Chicago."
    },
    {
        "title": "Lab 1",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "year": 2024,
        "description": "Worked on a lab that extensively involved HTML/CSS and an intro to the web platform."
    },
    {
        "title": "Lab 2",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "year": 2025,
        "description": "Worked on a lab that delved deeper into the CSS library and learned how to style webpages in a very direct and engaging manner."
    },
    {
        "title": "Lab 3",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "year": 2025,
        "description": "Worked with the very famous web development backend platform JS and got an intro on how to make the same elements with HTML/CSS with JS, added a couple extra elements using JS."
    },
    {
        "title": "Traffic Detection on Busy Streets",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Collabed with a Stanford/MIT alumni to analyze traffic patterns in residential and business complexes, and built a TensorFlow/Keras AI CNN to classify vehicles in busy streets in Irvine."
    },
    {
        "title": "Taylor Swift Discography Music Analysis",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed midterm projects for DSC 10 analyzing Taylor Swift's discography and identified the two similar songs in her discography with 95% accuracy."
    },
    {
        "title": "NASA Meteorite Landings",
        "year": 2023,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Project conducting analysis on NASA's open source dataset of meteorite landings. Conducted hypothesis testing using Python, including defining hypotheses, and getting a 94% efficiency for the most observed asteroids in 2000s using Babypandas"
    },
    {
        "title": "Prototype Web Browser Framework",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a prototype web browser using Java and stack data structures. Tested and achieved 92% accuracy using JUnit 5 for functionality validation."
    },
    {
        "title": "Arabic Numeral Image Processing Model",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a model to retrieve the three closest matches for Arabic numeral test images from a large dataset trained on 100,000+ images. Achieved 96.7% accuracy using a min-heap priority queue with Euclidean distance for pixel similarity."
    },
    {
        "title": "Power Outages in the Continental U.S.",
        "year": 2024,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Utilized predictive modeling on test data in the real-world to analyze power outage trends across the U.S. over 15+ years. Used Python’s scikit-learn for machine learning and Pandas to create a regression model, achieving an RMSE of 0.075."
    },
    {
        "title": "Southern California Cybersecurity Mayors Cup",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Participated in a regional cybersecurity competition that emphasized multiple offensive and defensive techniques such as password encrypting, image processing, analyzing incoming and outgoing DNS cache packets and network logging, cryptography/decoding using a Caesar cipher and hashing decoder."
    },
    {
        "title": "Riverside County Hackathon",
        "year": 2022,
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Participated in a statewide coding competition that emphasized multiple Java and Python programming challenges that had similar difficulty to LeetCode exercises."
    }
]